a=3
print(bin(a)) # 0b 11   十进制转二进制

b=0b10111   # 0b 二进制
print(int(b))

c=0o6430    # 0o 八进制
print(int(c))

d=0x9a5b  #  0x  十六进制
print(int(d))

'''
&  与
|  或
~  非
^  异或
<< 左移
>> 右移

'''
print(3 & 2)

'''
类似and
1 True  0  False
   0000 0011
&  0000 0010
--------------
   0000 0010



'''

print(5|3)   #  | 类似or

print(~5)    # 取反  将十进制对应的二进制进行取反操作

# 异或  ^    相同为0   不同为1
print(3^5)
'''
3  0000 0011
5  0000 0101
-------------
   0000 0110
'''

#左移乘2^n     右移除2^n
print(2<<1) # 4

print(2>>1) # 1 